План_полетов_файловый_edt/src/Documents/Прилеты/Прилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Прилеты</name>
  <registerRecords>AccumulationRegister.ДанныеПрилетов</registerRecords>
  <attributes>
    <name>ВылетИзКпПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВылетИзКпФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеРасчет</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>CatalogRef.ПричиныЗадержекПрилетаВылетаВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапаснойАП</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеНаЗапаснойАП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Регулярность</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеприбытия</name>
    <type>
      <types>CatalogRef.ПричиныНеприбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Неприбыл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КВС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>УходНаЗапаснойАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадержкаПрилета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВСуточныйПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

План_полетов_файловый_edt/src/AccumulationRegisters/ДанныеПрилетов/ДанныеПрилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеПрилетов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВылетИзКпПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВылетИзКпФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеРасчет</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапаснойАП</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеНаЗапаснойАП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Регулярность</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>CatalogRef.ПричиныЗадержекПрилетаВылетаВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеприбытия</name>
    <type>
      <types>CatalogRef.ПричиныНеприбытия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УходНаЗапаснойАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗадержкаПрилета</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Неприбыл</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

План_полетов_файловый_edt/src/Documents/Прилеты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДанныеПрилетов.Записывать = Истина;
	Движение = Движения.ДанныеПрилетов.Добавить();
	Движение.Период = Дата;
	Движение.Дата = Дата(Дата);
	Движение.Рейс = Рейс;
	Движение.ПассажирыВзрослые = ПассажирыВзрослые;
	Движение.ПассажирыДети = ПассажирыДети;
	Движение.ПассажирыМалыши = ПассажирыМалыши;
	Движение.РучнаяКладь = РучнаяКладь;
	Движение.Багаж = Багаж;
	Движение.Почта = Почта;
	Движение.Груз = Груз;
	Движение.ВылетИзКпПлан = ВылетИзКпПлан;
	Движение.ВылетИзКпФакт = ВылетИзКпФакт;
	Движение.ПрибытиеПлан = ПрибытиеПлан;
	Движение.ПрибытиеФакт = ПрибытиеФакт;
	Движение.ПрибытиеРасчет = ПрибытиеРасчет;
	Движение.УходНаЗапаснойАП = УходНаЗапаснойАП;
	Движение.ЗапаснойАП = ЗапаснойАП;
	Движение.ПрибытиеНаЗапаснойАП = ПрибытиеНаЗапаснойАП;
	Движение.Регулярность = Регулярность;
	Движение.Примечание = Примечание;
	Движение.НомерБорта = НомерБорта;
	Движение.ТипВС = ТипВС;
	Движение.АэропортВылета = АэропортВылета;
	Движение.АэропортПрилета = АэропортПрилета;
	Движение.ЗадержкаПрилета = ЗадержкаПрилета;
	Движение.Неприбыл = Неприбыл;
	Движение.ПричинаЗадержки = ПричинаЗадержки;
	Движение.ПричинаНеприбытия = ПричинаНеприбытия;
КонецПроцедуры
